input_openfoam/tutorials/incompressible/simpleFoam/turbulentFlatPlate/0.kEpsilon/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.08e-3; // 1.08e-3 = 1.125*(69.4)^2/5e6 // 11=3.9% 18.1=5%;

boundaryField
{
    inlet
    {
        type            fixedValue;

//        type            turbulentIntensityKineticEnergyInlet;
//        intensity       0.05;           // 5% turbulence
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    topWall
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    symmetry
    {
        type            symmetryPlane;
    }
  
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
